Пара:
Машуков - Гончаров

Стиль:
На равных

Разрабратывали:
Компоненты ProjectsCatalog и ProjectsList - классы, отвечающие за вывод списка проектов на странице Projects

Понравилось:
Машуков:
совместно решать проблемы возникающие во время написания кода и решать с напарником каким образом грамотнее всего организовать код

Гончаров:
проводить code review изменений напарника, что улучшает качество кода

Вывод:
Данный стиль программирования обеспечил возможность поделиться опытом непосредственно написания кода, а также производить code review на этапе его создания.
